Tekla Open API Reference for Tekla Structures 2025
GenericAttributesBase Class
 The GenericAttributesBase class is a base class that shared attributes among many classes use.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 More...
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class GenericAttributesBase : IIsEqual
<SerializableAttribute>
Public MustInherit Class GenericAttributesBase
	Implements IIsEqual
The GenericAttributesBase type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.ArrowheadAttributes
 Tekla.Structures.Drawing.DetailMarkTagsAttributes
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombinedDimensionAttributes
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes
 Tekla.Structures.Drawing.DPMPrinterAttributes
 Tekla.Structures.Drawing.FontAttributes
 Tekla.Structures.Drawing.HatchAttributes
 Tekla.Structures.Drawing.LineTypeAttributes
 Tekla.Structures.Drawing.LinkFrameAttributes
 Tekla.Structures.Drawing.PlacingAttributes
 Tekla.Structures.Drawing.PlacingDirectionAttributes
 Tekla.Structures.Drawing.PlacingDistanceAttributes
 Tekla.Structures.Drawing.PlacingQuarterAttributes
 Tekla.Structures.Drawing.PrintAttributes
 Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol
 Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes
 Tekla.Structures.Drawing.TemplateInfo
 Tekla.Structures.Drawing.UnitAttributes
 Tekla.Structures.Drawing.View.ViewMarkTagsAttributes
 Tekla.Structures.Drawing.View.ViewShorteningAttributes
 Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes
 Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
 Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes